Examinator/src/Catalogs/РесурсыОбъектовСУЗ/РесурсыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыОбъектовСУЗ</name>
  <owners>Catalog.СтраницыСУЗ</owners>
  <owners>Catalog.ВопросыСУЗ</owners>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/РесурсыОбъектовСУЗ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;		
	
	Если НЕ Подсказка И НЕ ЗначениеЗаполнено(Ресурс) Тогда
		Текст = НСтр("ru = 'Укажите ресурс'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
